org/posts/cpp.org
#+TITLE: C++
#+DATE: 2026-07-01
#+TAGS: Programming
#+DESCRIPTION: A comprehensive C++ guide covering language fundamentals, OOP, templates, modern C++ idioms, memory management, concurrency, performance, tooling, and expert engineering practices.
#+OPTIONS: toc:nil num:nil html-postamble:nil
#+HTML_HEAD: <link rel="stylesheet" href="/static/css/style.css" type="text/css"/>

#+INCLUDE: "../header.org"

* C++ Programming Q&A (Beginner - Expert)

** Beginner Level

*** Q1: What is C++?
 C++ is a powerful, general-purpose programming language used in systems software, games, embedded devices, high-performance servers, and many large applications.  
 It supports multiple styles of programming—procedural, object-oriented, and generic—so you can write both low-level efficient code and high-level abstractions.

*** Q2: What does a minimal C++ program look like?
 Every C++ program starts from the ~main~ function.  
 A minimal example prints text and returns ~0~ to indicate success.

#+begin_src cpp
#include <iostream>

int main() {
    std::cout << "Hello, world!\n";
    return 0;
}
#+end_src

*** Q3: What is the difference between C and C++?
 C focuses on procedural programming and stays close to hardware.  
 C++ keeps that power and adds classes, templates, RAII, stronger type features, and a larger standard library for safer, more expressive code.

*** Q4: What is a namespace?
 A namespace organizes code and prevents name collisions by grouping related identifiers under a named scope.

#+begin_src cpp
namespace math {
  int add(int a, int b) { return a + b; }
}
#+end_src

*** Q5: Why avoid ~using namespace std;~ in headers?
 Putting it in a header affects every file that includes that header.  
 This pollutes the global namespace and increases the chance of symbol conflicts.

*** Q6: What is ~std::cout~?
 ~std::cout~ is the standard output stream used to print formatted output to the console.

*** Q7: What is ~std::cin~?
 ~std::cin~ is the standard input stream used to read formatted input from the user or another input source.

*** Q8: What is a variable declaration?
 A declaration introduces a variable name and type, and may also initialize it.

#+begin_src cpp
int x = 5;
#+end_src

*** Q9: What are common built-in types in C++?
 Common fundamental types include ~bool~, ~char~, ~int~, ~float~, ~double~, and ~void~, plus signed/unsigned and fixed-width integer variants.

*** Q10: What is ~auto~ in C++?
 ~auto~ lets the compiler deduce a variable’s type from its initializer, reducing verbosity and keeping code consistent.

#+begin_src cpp
auto x = 42;      // int
auto y = 3.14;    // double
#+end_src

*** Q11: What is the difference between = and == ?
- ~=~ assigns a value to a variable
- ~==~ compares two values for equality

*** Q12: What are references?
 A reference is an alias to an existing object.  
 It must be initialized when declared and normally cannot be rebound to another object later.

#+begin_src cpp
int x = 10;
int& r = x;
#+end_src

*** Q13: Difference between pointer and reference?
- Pointer: can be null, can be reseated, needs dereference syntax
- Reference: must refer to a valid object, cannot usually be reseated, simpler syntax

*** Q14: What is const?
 ~const~ marks data as read-only through that particular name/view, helping prevent accidental modification.

*** Q15: What is ~const int*~ vs ~int* const~?
- ~const int* p~: pointer to const int (cannot modify pointed value through ~p~)
- ~int* const p~: const pointer to int (cannot change pointer target)

*** Q16: What is a function prototype?
 A function prototype declares a function’s signature before use, enabling type checking by the compiler.

*** Q17: What is function overloading?
 Overloading allows multiple functions with the same name but different parameter lists.

#+begin_src cpp
int f(int);
double f(double);
#+end_src

*** Q18: What is a default argument?
 A default argument provides a fallback value when a caller omits that parameter.

#+begin_src cpp
void log(int level = 1);
#+end_src

*** Q19: What is an inline function?
 ~inline~ allows multiple identical definitions across translation units (often in headers) and may enable inlining optimization.

*** Q20: What is a class?
 A class is a user-defined type that bundles state (data) and behavior (methods), with controlled access to internals.

