public/posts/cpp.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C++</title>
<meta name="description" content="A comprehensive C++ guide covering language fundamentals, OOP, templates, modern C++ idioms, memory management, concurrency, performance, tooling, and expert engineering practices." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">C++</h1>
</header><div class="site-header">
  <div class="site-title"><a href="/">Borislav Dostumski</a></div>
  <nav class="site-nav">
    <a href="/index.html">Index</a>
    <a href="/certificates.html">Certificates</a>
    <a href="/blog.html">Blog</a>
    <a href="/about.html">Bio</a>
  </nav>
</div>
<div id="outline-container-org1418467" class="outline-2">
<h2 id="org1418467">C++ Programming Q&amp;A (Beginner - Expert)</h2>
<div class="outline-text-2" id="text-org1418467">
</div>
<div id="outline-container-orgd6e0b63" class="outline-3">
<h3 id="orgd6e0b63">Beginner Level</h3>
<div class="outline-text-3" id="text-orgd6e0b63">
</div>
<div id="outline-container-orgebb1f03" class="outline-4">
<h4 id="orgebb1f03">Q1: What is C++?</h4>
<div class="outline-text-4" id="text-orgebb1f03">
<p>
C++ is a powerful, general-purpose programming language used in systems software, games, embedded devices, high-performance servers, and many large applications.  
It supports multiple styles of programming—procedural, object-oriented, and generic—so you can write both low-level efficient code and high-level abstractions.
</p>
</div>
</div>
<div id="outline-container-orgb7dfac9" class="outline-4">
<h4 id="orgb7dfac9">Q2: What does a minimal C++ program look like?</h4>
<div class="outline-text-4" id="text-orgb7dfac9">
<p>
Every C++ program starts from the <code>main</code> function.  
A minimal example prints text and returns <code>0</code> to indicate success.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;iostream&gt;</span>

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>() {
    <span style="font-weight: bold; text-decoration: underline;">std</span>::cout &lt;&lt; <span style="font-style: italic;">"Hello, world!\n"</span>;
    <span style="font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org816035c" class="outline-4">
<h4 id="org816035c">Q3: What is the difference between C and C++?</h4>
<div class="outline-text-4" id="text-org816035c">
<p>
C focuses on procedural programming and stays close to hardware.  
C++ keeps that power and adds classes, templates, RAII, stronger type features, and a larger standard library for safer, more expressive code.
</p>
</div>
</div>
<div id="outline-container-org66f6a51" class="outline-4">
<h4 id="org66f6a51">Q4: What is a namespace?</h4>
<div class="outline-text-4" id="text-org66f6a51">
<p>
A namespace organizes code and prevents name collisions by grouping related identifiers under a named scope.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold;">namespace</span> <span style="font-weight: bold; text-decoration: underline;">math</span> {
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">add</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">b</span>) { <span style="font-weight: bold;">return</span> a + b; }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeb2f20b" class="outline-4">
<h4 id="orgeb2f20b">Q5: Why avoid <code>using namespace std;</code> in headers?</h4>
<div class="outline-text-4" id="text-orgeb2f20b">
<p>
Putting it in a header affects every file that includes that header.  
This pollutes the global namespace and increases the chance of symbol conflicts.
</p>
</div>
</div>
<div id="outline-container-orgc25ce87" class="outline-4">
<h4 id="orgc25ce87">Q6: What is <code>std::cout</code>?</h4>
<div class="outline-text-4" id="text-orgc25ce87">
<p>
<code>std::cout</code> is the standard output stream used to print formatted output to the console.
</p>
</div>
</div>
<div id="outline-container-org686da72" class="outline-4">
<h4 id="org686da72">Q7: What is <code>std::cin</code>?</h4>
<div class="outline-text-4" id="text-org686da72">
<p>
<code>std::cin</code> is the standard input stream used to read formatted input from the user or another input source.
</p>
</div>
</div>
<div id="outline-container-orgb0f3c71" class="outline-4">
<h4 id="orgb0f3c71">Q8: What is a variable declaration?</h4>
<div class="outline-text-4" id="text-orgb0f3c71">
<p>
A declaration introduces a variable name and type, and may also initialize it.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">x</span> = 5;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb6b9d07" class="outline-4">
<h4 id="orgb6b9d07">Q9: What are common built-in types in C++?</h4>
<div class="outline-text-4" id="text-orgb6b9d07">
<p>
Common fundamental types include <code>bool</code>, <code>char</code>, <code>int</code>, <code>float</code>, <code>double</code>, and <code>void</code>, plus signed/unsigned and fixed-width integer variants.
</p>
</div>
</div>
<div id="outline-container-orge074b2f" class="outline-4">
<h4 id="orge074b2f">Q10: What is <code>auto</code> in C++?</h4>
<div class="outline-text-4" id="text-orge074b2f">
<p>
<code>auto</code> lets the compiler deduce a variable’s type from its initializer, reducing verbosity and keeping code consistent.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold;">auto</span> <span style="font-weight: bold; font-style: italic;">x</span> = 42;      <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">int
</span><span style="font-weight: bold;">auto</span> <span style="font-weight: bold; font-style: italic;">y</span> = 3.14;    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">double</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc641dd6" class="outline-4">
<h4 id="orgc641dd6">Q11: What is the difference between = and == ?</h4>
<div class="outline-text-4" id="text-orgc641dd6">
<ul class="org-ul">
<li><code>=</code> assigns a value to a variable</li>
<li><code>==</code> compares two values for equality</li>
</ul>
</div>
</div>
<div id="outline-container-org3a7a280" class="outline-4">
<h4 id="org3a7a280">Q12: What are references?</h4>
<div class="outline-text-4" id="text-org3a7a280">
<p>
A reference is an alias to an existing object.  
It must be initialized when declared and normally cannot be rebound to another object later.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">x</span> = 10;
<span style="font-weight: bold; text-decoration: underline;">int</span>&amp; <span style="font-weight: bold; font-style: italic;">r</span> = x;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbb83272" class="outline-4">
<h4 id="orgbb83272">Q13: Difference between pointer and reference?</h4>
<div class="outline-text-4" id="text-orgbb83272">
<ul class="org-ul">
<li>Pointer: can be null, can be reseated, needs dereference syntax</li>
<li>Reference: must refer to a valid object, cannot usually be reseated, simpler syntax</li>
</ul>
</div>
</div>
<div id="outline-container-orgb4eabda" class="outline-4">
<h4 id="orgb4eabda">Q14: What is const?</h4>
<div class="outline-text-4" id="text-orgb4eabda">
<p>
<code>const</code> marks data as read-only through that particular name/view, helping prevent accidental modification.
</p>
</div>
</div>
<div id="outline-container-orgcb2de9a" class="outline-4">
<h4 id="orgcb2de9a">Q15: What is <code>const int*</code> vs <code>int* const</code>?</h4>
<div class="outline-text-4" id="text-orgcb2de9a">
<ul class="org-ul">
<li><code>const int* p</code>: pointer to const int (cannot modify pointed value through <code>p</code>)</li>
<li><code>int* const p</code>: const pointer to int (cannot change pointer target)</li>
</ul>
</div>
</div>
<div id="outline-container-org92cbfae" class="outline-4">
<h4 id="org92cbfae">Q16: What is a function prototype?</h4>
<div class="outline-text-4" id="text-org92cbfae">
<p>
A function prototype declares a function’s signature before use, enabling type checking by the compiler.
</p>
</div>
</div>
<div id="outline-container-org789af73" class="outline-4">
<h4 id="org789af73">Q17: What is function overloading?</h4>
<div class="outline-text-4" id="text-org789af73">
<p>
Overloading allows multiple functions with the same name but different parameter lists.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">f</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>);
<span style="font-weight: bold; text-decoration: underline;">double</span> <span style="font-weight: bold;">f</span>(<span style="font-weight: bold; text-decoration: underline;">double</span>);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc974016" class="outline-4">
<h4 id="orgc974016">Q18: What is a default argument?</h4>
<div class="outline-text-4" id="text-orgc974016">
<p>
A default argument provides a fallback value when a caller omits that parameter.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">log</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">level</span> = 1);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb3a4c9d" class="outline-4">
<h4 id="orgb3a4c9d">Q19: What is an inline function?</h4>
<div class="outline-text-4" id="text-orgb3a4c9d">
<p>
<code>inline</code> allows multiple identical definitions across translation units (often in headers) and may enable inlining optimization.
</p>
</div>
</div>
<div id="outline-container-org1143725" class="outline-4">
<h4 id="org1143725">Q20: What is a class?</h4>
<div class="outline-text-4" id="text-org1143725">
<p>
A class is a user-defined type that bundles state (data) and behavior (methods), with controlled access to internals.
</p>
</div>
</div>
