org/posts/cpp.org
*** Q21: Difference between class and struct in C++?
 They are nearly identical in capability; the key default differs:
- ~class~ defaults to ~private~
- ~struct~ defaults to ~public~

*** Q22: What are access specifiers?
 ~public~, ~private~, and ~protected~ control who can access class members.

*** Q23: What is encapsulation?
 Encapsulation means exposing a clear public interface while hiding implementation details.

*** Q24: What is a constructor?
 A constructor initializes an object at creation time.

*** Q25: What is a destructor?
 A destructor runs automatically when object lifetime ends, commonly to release resources.

*** Q26: Can constructors be overloaded?
 Yes. Different constructor signatures support multiple ways to initialize objects.

*** Q27: What is an initializer list in a constructor?
 It initializes members directly before entering constructor body, which is often required or more efficient.

#+begin_src cpp
struct S {
  int x;
  S(int v) : x(v) {}
};
#+end_src

*** Q28: Why prefer initialization over assignment in constructor body?
 Direct initialization avoids extra work and is required for ~const~ and reference members.

*** Q29: What is RAII?
 RAII (Resource Acquisition Is Initialization) ties resource lifetime (memory, files, locks) to object lifetime.

*** Q30: Why is RAII important?
 It guarantees cleanup automatically, reduces leaks, and improves exception safety.

*** Q31: What are ~new~ and ~delete~?
 Operators for manual dynamic memory allocation/deallocation.  
 In modern C++, smart pointers and containers are preferred.

*** Q32: Why avoid raw ~new/delete~ in application code?
 Manual ownership is error-prone (leaks, double-free, lifetime bugs).  
 Prefer ~std::unique_ptr~, ~std::shared_ptr~, ~std::vector~, etc.

*** Q33: What is ~nullptr~?
 ~nullptr~ is the dedicated null pointer literal (C++11+), safer than integer-like null macros.

*** Q34: Difference between ~NULL~ and ~nullptr~?
 ~nullptr~ has a proper null-pointer type and avoids overload ambiguity; ~NULL~ is often just ~0~ or ~0L~.

*** Q35: What is an array?
 An array is a fixed-size contiguous block of elements of one type.

*** Q36: Why prefer ~std::array~ over raw arrays for fixed size?
 ~std::array~ provides STL compatibility, size awareness, and value semantics while staying fixed-size.

*** Q37: Why prefer ~std::vector~ for dynamic arrays?
 ~std::vector~ automatically manages memory, resizes dynamically, and stores elements contiguously.

*** Q38: What is a string in C++?
 ~std::string~ is an owning, dynamic text type that is safer and easier than raw C-style strings.

*** Q39: What is a range-based for loop?
 It offers clean, readable iteration over container elements.

#+begin_src cpp
for (const auto& v : vec) { /* ... */ }
#+end_src

*** Q40: What is the benefit of type inference?
 It reduces repetitive type spelling and keeps declarations aligned with initializer types.

** Intermediate Level

*** Q41: What is a copy constructor?
 It constructs a new object from another object of the same type.

*** Q42: What is a copy assignment operator?
 It copies one existing object’s state into another existing object.

*** Q43: What is a move constructor?
 It transfers resources from a temporary/rvalue into a newly created object.

*** Q44: What is a move assignment operator?
 It transfers resources from an rvalue into an already existing object.

*** Q45: What is Rule of Three?
 If a class defines destructor, copy constructor, or copy assignment, it usually needs all three.

*** Q46: What is Rule of Five?
 Rule of Three plus move constructor and move assignment for modern C++ resource-aware types.

*** Q47: What is Rule of Zero?
 Design types so compiler-generated special members are enough by using RAII members.

*** Q48: What does ~= default~ mean?
 It requests the compiler-generated default implementation explicitly.

*** Q49: What does ~= delete~ mean?
 It forbids a function, preventing invalid usage at compile time.

#+begin_src cpp
MyType(const MyType&) = delete;
#+end_src

*** Q50: What is lvalue vs rvalue?
- Lvalue: has identity/location (can usually appear on left side of assignment)
- Rvalue: temporary/value expression (typically short-lived)

*** Q51: What is ~std::move~?
 ~std::move~ casts to an rvalue expression so move operations become eligible.  
 It does not move data by itself.

*** Q52: What is moved-from state?
 A moved-from object remains valid but its value/content is usually unspecified unless documented.

*** Q53: What is perfect forwarding?
 It preserves value category (lvalue/rvalue) through template forwarding with ~std::forward~.

