public/posts/cpp.html
<div id="outline-container-org16b01fa" class="outline-4">
<h4 id="org16b01fa">Q21: Difference between class and struct in C++?</h4>
<div class="outline-text-4" id="text-org16b01fa">
<p>
They are nearly identical in capability; the key default differs:
</p>
<ul class="org-ul">
<li><code>class</code> defaults to <code>private</code></li>
<li><code>struct</code> defaults to <code>public</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgd28b70d" class="outline-4">
<h4 id="orgd28b70d">Q22: What are access specifiers?</h4>
<div class="outline-text-4" id="text-orgd28b70d">
<p>
<code>public</code>, <code>private</code>, and <code>protected</code> control who can access class members.
</p>
</div>
</div>
<div id="outline-container-org62ae7d0" class="outline-4">
<h4 id="org62ae7d0">Q23: What is encapsulation?</h4>
<div class="outline-text-4" id="text-org62ae7d0">
<p>
Encapsulation means exposing a clear public interface while hiding implementation details.
</p>
</div>
</div>
<div id="outline-container-org301d66b" class="outline-4">
<h4 id="org301d66b">Q24: What is a constructor?</h4>
<div class="outline-text-4" id="text-org301d66b">
<p>
A constructor initializes an object at creation time.
</p>
</div>
</div>
<div id="outline-container-orge0894cb" class="outline-4">
<h4 id="orge0894cb">Q25: What is a destructor?</h4>
<div class="outline-text-4" id="text-orge0894cb">
<p>
A destructor runs automatically when object lifetime ends, commonly to release resources.
</p>
</div>
</div>
<div id="outline-container-orgd7d752b" class="outline-4">
<h4 id="orgd7d752b">Q26: Can constructors be overloaded?</h4>
<div class="outline-text-4" id="text-orgd7d752b">
<p>
Yes. Different constructor signatures support multiple ways to initialize objects.
</p>
</div>
</div>
<div id="outline-container-org46e7664" class="outline-4">
<h4 id="org46e7664">Q27: What is an initializer list in a constructor?</h4>
<div class="outline-text-4" id="text-org46e7664">
<p>
It initializes members directly before entering constructor body, which is often required or more efficient.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">S</span> {
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">x</span>;
  <span style="font-weight: bold;">S</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">v</span>) : x(v) {}
};
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfa5e43a" class="outline-4">
<h4 id="orgfa5e43a">Q28: Why prefer initialization over assignment in constructor body?</h4>
<div class="outline-text-4" id="text-orgfa5e43a">
<p>
Direct initialization avoids extra work and is required for <code>const</code> and reference members.
</p>
</div>
</div>
<div id="outline-container-org9c1e1ef" class="outline-4">
<h4 id="org9c1e1ef">Q29: What is RAII?</h4>
<div class="outline-text-4" id="text-org9c1e1ef">
<p>
RAII (Resource Acquisition Is Initialization) ties resource lifetime (memory, files, locks) to object lifetime.
</p>
</div>
</div>
<div id="outline-container-orga4f835c" class="outline-4">
<h4 id="orga4f835c">Q30: Why is RAII important?</h4>
<div class="outline-text-4" id="text-orga4f835c">
<p>
It guarantees cleanup automatically, reduces leaks, and improves exception safety.
</p>
</div>
</div>
<div id="outline-container-orga5d5bc0" class="outline-4">
<h4 id="orga5d5bc0">Q31: What are <code>new</code> and <code>delete</code>?</h4>
<div class="outline-text-4" id="text-orga5d5bc0">
<p>
Operators for manual dynamic memory allocation/deallocation.  
In modern C++, smart pointers and containers are preferred.
</p>
</div>
</div>
<div id="outline-container-org95db2f8" class="outline-4">
<h4 id="org95db2f8">Q32: Why avoid raw <code>new/delete</code> in application code?</h4>
<div class="outline-text-4" id="text-org95db2f8">
<p>
Manual ownership is error-prone (leaks, double-free, lifetime bugs).  
Prefer <code>std::unique_ptr</code>, <code>std::shared_ptr</code>, <code>std::vector</code>, etc.
</p>
</div>
</div>
<div id="outline-container-orgba1c8ff" class="outline-4">
<h4 id="orgba1c8ff">Q33: What is <code>nullptr</code>?</h4>
<div class="outline-text-4" id="text-orgba1c8ff">
<p>
<code>nullptr</code> is the dedicated null pointer literal (C++11+), safer than integer-like null macros.
</p>
</div>
</div>
<div id="outline-container-orgc95975b" class="outline-4">
<h4 id="orgc95975b">Q34: Difference between <code>NULL</code> and <code>nullptr</code>?</h4>
<div class="outline-text-4" id="text-orgc95975b">
<p>
<code>nullptr</code> has a proper null-pointer type and avoids overload ambiguity; <code>NULL</code> is often just <code>0</code> or <code>0L</code>.
</p>
</div>
</div>
<div id="outline-container-org43f0062" class="outline-4">
<h4 id="org43f0062">Q35: What is an array?</h4>
<div class="outline-text-4" id="text-org43f0062">
<p>
An array is a fixed-size contiguous block of elements of one type.
</p>
</div>
</div>
<div id="outline-container-org41129a1" class="outline-4">
<h4 id="org41129a1">Q36: Why prefer <code>std::array</code> over raw arrays for fixed size?</h4>
<div class="outline-text-4" id="text-org41129a1">
<p>
<code>std::array</code> provides STL compatibility, size awareness, and value semantics while staying fixed-size.
</p>
</div>
</div>
<div id="outline-container-orgcbfd163" class="outline-4">
<h4 id="orgcbfd163">Q37: Why prefer <code>std::vector</code> for dynamic arrays?</h4>
<div class="outline-text-4" id="text-orgcbfd163">
<p>
<code>std::vector</code> automatically manages memory, resizes dynamically, and stores elements contiguously.
</p>
</div>
</div>
<div id="outline-container-org1a5cd93" class="outline-4">
<h4 id="org1a5cd93">Q38: What is a string in C++?</h4>
<div class="outline-text-4" id="text-org1a5cd93">
<p>
<code>std::string</code> is an owning, dynamic text type that is safer and easier than raw C-style strings.
</p>
</div>
</div>
<div id="outline-container-org49d984e" class="outline-4">
<h4 id="org49d984e">Q39: What is a range-based for loop?</h4>
<div class="outline-text-4" id="text-org49d984e">
<p>
It offers clean, readable iteration over container elements.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold;">for</span> (<span style="font-weight: bold;">const</span> <span style="font-weight: bold;">auto</span>&amp; <span style="font-weight: bold; font-style: italic;">v</span> : vec) { <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">...</span><span style="font-weight: bold; font-style: italic;"> */</span> }
</pre>
</div>
</div>
</div>
<div id="outline-container-orge10be47" class="outline-4">
<h4 id="orge10be47">Q40: What is the benefit of type inference?</h4>
<div class="outline-text-4" id="text-orge10be47">
<p>
It reduces repetitive type spelling and keeps declarations aligned with initializer types.
</p>
</div>
</div>
</div>
<div id="outline-container-org22453da" class="outline-3">
<h3 id="org22453da">Intermediate Level</h3>
<div class="outline-text-3" id="text-org22453da">
</div>
<div id="outline-container-orgfc5b708" class="outline-4">
<h4 id="orgfc5b708">Q41: What is a copy constructor?</h4>
<div class="outline-text-4" id="text-orgfc5b708">
<p>
It constructs a new object from another object of the same type.
</p>
</div>
</div>
<div id="outline-container-org0fa2dd4" class="outline-4">
<h4 id="org0fa2dd4">Q42: What is a copy assignment operator?</h4>
<div class="outline-text-4" id="text-org0fa2dd4">
<p>
It copies one existing object’s state into another existing object.
</p>
</div>
</div>
<div id="outline-container-org7f0c482" class="outline-4">
<h4 id="org7f0c482">Q43: What is a move constructor?</h4>
<div class="outline-text-4" id="text-org7f0c482">
<p>
It transfers resources from a temporary/rvalue into a newly created object.
</p>
</div>
</div>
<div id="outline-container-orga33ccb9" class="outline-4">
<h4 id="orga33ccb9">Q44: What is a move assignment operator?</h4>
<div class="outline-text-4" id="text-orga33ccb9">
<p>
It transfers resources from an rvalue into an already existing object.
</p>
</div>
</div>
<div id="outline-container-org2ee6af8" class="outline-4">
<h4 id="org2ee6af8">Q45: What is Rule of Three?</h4>
<div class="outline-text-4" id="text-org2ee6af8">
<p>
If a class defines destructor, copy constructor, or copy assignment, it usually needs all three.
</p>
</div>
</div>
<div id="outline-container-orge5356ac" class="outline-4">
<h4 id="orge5356ac">Q46: What is Rule of Five?</h4>
<div class="outline-text-4" id="text-orge5356ac">
<p>
Rule of Three plus move constructor and move assignment for modern C++ resource-aware types.
</p>
</div>
</div>
<div id="outline-container-orgb4bdc8d" class="outline-4">
<h4 id="orgb4bdc8d">Q47: What is Rule of Zero?</h4>
<div class="outline-text-4" id="text-orgb4bdc8d">
<p>
Design types so compiler-generated special members are enough by using RAII members.
</p>
</div>
</div>
<div id="outline-container-org0a5ed5f" class="outline-4">
<h4 id="org0a5ed5f">Q48: What does <code>= default</code> mean?</h4>
<div class="outline-text-4" id="text-org0a5ed5f">
<p>
It requests the compiler-generated default implementation explicitly.
</p>
</div>
</div>
<div id="outline-container-org10f2859" class="outline-4">
<h4 id="org10f2859">Q49: What does <code>= delete</code> mean?</h4>
<div class="outline-text-4" id="text-org10f2859">
<p>
It forbids a function, preventing invalid usage at compile time.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold;">MyType</span>(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">MyType</span>&amp;) = <span style="font-weight: bold;">delete</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orga616df7" class="outline-4">
<h4 id="orga616df7">Q50: What is lvalue vs rvalue?</h4>
<div class="outline-text-4" id="text-orga616df7">
<ul class="org-ul">
<li>Lvalue: has identity/location (can usually appear on left side of assignment)</li>
<li>Rvalue: temporary/value expression (typically short-lived)</li>
</ul>
</div>
</div>
<div id="outline-container-orgdcce002" class="outline-4">
<h4 id="orgdcce002">Q51: What is <code>std::move</code>?</h4>
<div class="outline-text-4" id="text-orgdcce002">
<p>
<code>std::move</code> casts to an rvalue expression so move operations become eligible.  
It does not move data by itself.
</p>
</div>
</div>
<div id="outline-container-org23660ef" class="outline-4">
<h4 id="org23660ef">Q52: What is moved-from state?</h4>
<div class="outline-text-4" id="text-org23660ef">
<p>
A moved-from object remains valid but its value/content is usually unspecified unless documented.
</p>
</div>
</div>
<div id="outline-container-org73e535e" class="outline-4">
<h4 id="org73e535e">Q53: What is perfect forwarding?</h4>
<div class="outline-text-4" id="text-org73e535e">
<p>
It preserves value category (lvalue/rvalue) through template forwarding with <code>std::forward</code>.
</p>
</div>
</div>
