org/posts/cpp.org
*** Q54: What is a forwarding reference?
 ~T&&~ in a deduced template context; it can bind to both lvalues and rvalues.

*** Q55: What are exceptions?
 Exceptions are a structured error propagation system using ~throw~, ~try~, and ~catch~.

*** Q56: When should exceptions be avoided?
 In codebases with strict low-latency/real-time constraints or policies that prohibit exceptions.

*** Q57: What is stack unwinding?
 During exception propagation, local objects are destroyed automatically in reverse construction order.

*** Q58: Why should destructors not throw?
 Throwing during unwinding may cause ~std::terminate~, ending the program abruptly.

*** Q59: What does ~noexcept~ mean?
 It states that a function is not expected to throw; violating it may terminate the program.

*** Q60: Why mark move operations ~noexcept~?
 Containers can then use moves during reallocation, improving both performance and safety.

*** Q61: What is a template?
 A template is a generic blueprint for functions or classes resolved at compile time.

*** Q62: What is a function template?

#+begin_src cpp
template<typename T>
T add(T a, T b) { return a + b; }
#+end_src

*** Q63: What is a class template?
 A class parameterized by types/values to create reusable generic components.

*** Q64: What is template specialization?
 A customized implementation for specific template arguments.

*** Q65: What is partial specialization?
 Specializing a class template for a subset/pattern of template parameters.

*** Q66: What are non-type template parameters?
 Template parameters that are values (e.g., integers, pointers, ~auto~ NTTPs in newer standards).

*** Q67: What is ~constexpr~?
 ~constexpr~ enables compile-time evaluation when expression context and inputs allow.

*** Q68: Difference between ~const~ and ~constexpr~?
- ~const~: value is read-only
- ~constexpr~: value/function can participate in constant-expression contexts

*** Q69: What is ~if constexpr~?
 A compile-time conditional, useful for selecting valid template branches.

*** Q70: What is ~static_assert~?
 A compile-time assertion with a readable error message when condition fails.

*** Q71: What is STL?
 STL is the core generic library toolkit: containers, iterators, algorithms, and utilities.

*** Q72: Common STL containers?
 ~vector~, ~deque~, ~list~, ~map~, ~unordered_map~, ~set~, ~unordered_set~, ~array~, ~string~.

*** Q73: How to choose ~map~ vs ~unordered_map~?
- ~map~: ordered keys, predictable iteration, O(log n)
- ~unordered_map~: hash table, average O(1), no key ordering

*** Q74: What are iterators?
 Iterators are generalized traversal objects used to access container elements.

*** Q75: Difference between ~begin/end~ and ~cbegin/cend~?
 ~cbegin/cend~ return const iterators, preventing element modification via iterator.

*** Q76: What are algorithms in ~<algorithm>~?
 Reusable operations like ~sort~, ~find~, ~transform~, ~copy~, ~count_if~, etc.

*** Q77: Why prefer algorithms over handwritten loops?
 They are expressive, less error-prone, composable, and often optimized.

*** Q78: What is a lambda expression?
 A lambda is an inline anonymous function object.

#+begin_src cpp
auto sq = [](int x){ return x * x; };
#+end_src

*** Q79: What is lambda capture?
 Capture list defines how outer variables are used inside lambda: by value, by reference, or explicit per-variable capture.

*** Q80: What is a mutable lambda?
 It allows modification of by-value captured variables inside the lambda body.

*** Q81: What is ~std::function~?
 A type-erased callable wrapper for storing any compatible callable target.

*** Q82: What is the cost of ~std::function~?
 It may add indirection and potential allocations.  
 For hot paths, templates/auto callables can be cheaper.

*** Q83: What is ~std::bind~?
 ~std::bind~ creates adapted callables by binding arguments; lambdas are usually clearer in modern code.

*** Q84: What is ~enum class~?
 A scoped, strongly typed enum that avoids implicit conversions and name pollution.

*** Q85: Why use ~enum class~ over ~enum~?
 Better type safety, clearer intent, and reduced accidental misuse.

*** Q86: What is ~friend~ in C++?
 ~friend~ grants selected external functions/classes access to private/protected members.

*** Q87: What is operator overloading?
 Defining custom behavior for operators on user-defined types.

*** Q88: Which operators should be overloaded carefully?
 Operators such as ~&&~, ~||~, comma, address-of, and implicit conversion operators can be surprising if misused.

