public/posts/cpp.html
<div id="outline-container-org55689f4" class="outline-4">
<h4 id="org55689f4">Q54: What is a forwarding reference?</h4>
<div class="outline-text-4" id="text-org55689f4">
<p>
<code>T&amp;&amp;</code> in a deduced template context; it can bind to both lvalues and rvalues.
</p>
</div>
</div>
<div id="outline-container-org73f7207" class="outline-4">
<h4 id="org73f7207">Q55: What are exceptions?</h4>
<div class="outline-text-4" id="text-org73f7207">
<p>
Exceptions are a structured error propagation system using <code>throw</code>, <code>try</code>, and <code>catch</code>.
</p>
</div>
</div>
<div id="outline-container-org2d35e13" class="outline-4">
<h4 id="org2d35e13">Q56: When should exceptions be avoided?</h4>
<div class="outline-text-4" id="text-org2d35e13">
<p>
In codebases with strict low-latency/real-time constraints or policies that prohibit exceptions.
</p>
</div>
</div>
<div id="outline-container-orgaea55f5" class="outline-4">
<h4 id="orgaea55f5">Q57: What is stack unwinding?</h4>
<div class="outline-text-4" id="text-orgaea55f5">
<p>
During exception propagation, local objects are destroyed automatically in reverse construction order.
</p>
</div>
</div>
<div id="outline-container-org064c8ae" class="outline-4">
<h4 id="org064c8ae">Q58: Why should destructors not throw?</h4>
<div class="outline-text-4" id="text-org064c8ae">
<p>
Throwing during unwinding may cause <code>std::terminate</code>, ending the program abruptly.
</p>
</div>
</div>
<div id="outline-container-orgad5276d" class="outline-4">
<h4 id="orgad5276d">Q59: What does <code>noexcept</code> mean?</h4>
<div class="outline-text-4" id="text-orgad5276d">
<p>
It states that a function is not expected to throw; violating it may terminate the program.
</p>
</div>
</div>
<div id="outline-container-orge1968bc" class="outline-4">
<h4 id="orge1968bc">Q60: Why mark move operations <code>noexcept</code>?</h4>
<div class="outline-text-4" id="text-orge1968bc">
<p>
Containers can then use moves during reallocation, improving both performance and safety.
</p>
</div>
</div>
<div id="outline-container-org82f56a0" class="outline-4">
<h4 id="org82f56a0">Q61: What is a template?</h4>
<div class="outline-text-4" id="text-org82f56a0">
<p>
A template is a generic blueprint for functions or classes resolved at compile time.
</p>
</div>
</div>
<div id="outline-container-org0c324c1" class="outline-4">
<h4 id="org0c324c1">Q62: What is a function template?</h4>
<div class="outline-text-4" id="text-org0c324c1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold;">template</span>&lt;<span style="font-weight: bold;">typename</span> <span style="font-weight: bold; text-decoration: underline;">T</span>&gt;
<span style="font-weight: bold; text-decoration: underline;">T</span> <span style="font-weight: bold;">add</span>(<span style="font-weight: bold; text-decoration: underline;">T</span> <span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; text-decoration: underline;">T</span> <span style="font-weight: bold; font-style: italic;">b</span>) { <span style="font-weight: bold;">return</span> a + b; }
</pre>
</div>
</div>
</div>
<div id="outline-container-org790eb2d" class="outline-4">
<h4 id="org790eb2d">Q63: What is a class template?</h4>
<div class="outline-text-4" id="text-org790eb2d">
<p>
A class parameterized by types/values to create reusable generic components.
</p>
</div>
</div>
<div id="outline-container-org5eae697" class="outline-4">
<h4 id="org5eae697">Q64: What is template specialization?</h4>
<div class="outline-text-4" id="text-org5eae697">
<p>
A customized implementation for specific template arguments.
</p>
</div>
</div>
<div id="outline-container-org88ffda4" class="outline-4">
<h4 id="org88ffda4">Q65: What is partial specialization?</h4>
<div class="outline-text-4" id="text-org88ffda4">
<p>
Specializing a class template for a subset/pattern of template parameters.
</p>
</div>
</div>
<div id="outline-container-orgd1995d3" class="outline-4">
<h4 id="orgd1995d3">Q66: What are non-type template parameters?</h4>
<div class="outline-text-4" id="text-orgd1995d3">
<p>
Template parameters that are values (e.g., integers, pointers, <code>auto</code> NTTPs in newer standards).
</p>
</div>
</div>
<div id="outline-container-orgc142bcd" class="outline-4">
<h4 id="orgc142bcd">Q67: What is <code>constexpr</code>?</h4>
<div class="outline-text-4" id="text-orgc142bcd">
<p>
<code>constexpr</code> enables compile-time evaluation when expression context and inputs allow.
</p>
</div>
</div>
<div id="outline-container-org418ec70" class="outline-4">
<h4 id="org418ec70">Q68: Difference between <code>const</code> and <code>constexpr</code>?</h4>
<div class="outline-text-4" id="text-org418ec70">
<ul class="org-ul">
<li><code>const</code>: value is read-only</li>
<li><code>constexpr</code>: value/function can participate in constant-expression contexts</li>
</ul>
</div>
</div>
<div id="outline-container-orgc8d9bea" class="outline-4">
<h4 id="orgc8d9bea">Q69: What is <code>if constexpr</code>?</h4>
<div class="outline-text-4" id="text-orgc8d9bea">
<p>
A compile-time conditional, useful for selecting valid template branches.
</p>
</div>
</div>
<div id="outline-container-org28e42ce" class="outline-4">
<h4 id="org28e42ce">Q70: What is <code>static_assert</code>?</h4>
<div class="outline-text-4" id="text-org28e42ce">
<p>
A compile-time assertion with a readable error message when condition fails.
</p>
</div>
</div>
<div id="outline-container-orgfd97dfe" class="outline-4">
<h4 id="orgfd97dfe">Q71: What is STL?</h4>
<div class="outline-text-4" id="text-orgfd97dfe">
<p>
STL is the core generic library toolkit: containers, iterators, algorithms, and utilities.
</p>
</div>
</div>
<div id="outline-container-org312faf9" class="outline-4">
<h4 id="org312faf9">Q72: Common STL containers?</h4>
<div class="outline-text-4" id="text-org312faf9">
<p>
<code>vector</code>, <code>deque</code>, <code>list</code>, <code>map</code>, <code>unordered_map</code>, <code>set</code>, <code>unordered_set</code>, <code>array</code>, <code>string</code>.
</p>
</div>
</div>
<div id="outline-container-org0118a86" class="outline-4">
<h4 id="org0118a86">Q73: How to choose <code>map</code> vs <code>unordered_map</code>?</h4>
<div class="outline-text-4" id="text-org0118a86">
<ul class="org-ul">
<li><code>map</code>: ordered keys, predictable iteration, O(log n)</li>
<li><code>unordered_map</code>: hash table, average O(1), no key ordering</li>
</ul>
</div>
</div>
<div id="outline-container-org07fce4f" class="outline-4">
<h4 id="org07fce4f">Q74: What are iterators?</h4>
<div class="outline-text-4" id="text-org07fce4f">
<p>
Iterators are generalized traversal objects used to access container elements.
</p>
</div>
</div>
<div id="outline-container-orgd63ebd2" class="outline-4">
<h4 id="orgd63ebd2">Q75: Difference between <code>begin/end</code> and <code>cbegin/cend</code>?</h4>
<div class="outline-text-4" id="text-orgd63ebd2">
<p>
<code>cbegin/cend</code> return const iterators, preventing element modification via iterator.
</p>
</div>
</div>
<div id="outline-container-org4d6c29b" class="outline-4">
<h4 id="org4d6c29b">Q76: What are algorithms in <code>&lt;algorithm&gt;</code>?</h4>
<div class="outline-text-4" id="text-org4d6c29b">
<p>
Reusable operations like <code>sort</code>, <code>find</code>, <code>transform</code>, <code>copy</code>, <code>count_if</code>, etc.
</p>
</div>
</div>
<div id="outline-container-org0ec8eab" class="outline-4">
<h4 id="org0ec8eab">Q77: Why prefer algorithms over handwritten loops?</h4>
<div class="outline-text-4" id="text-org0ec8eab">
<p>
They are expressive, less error-prone, composable, and often optimized.
</p>
</div>
</div>
<div id="outline-container-org5c05c42" class="outline-4">
<h4 id="org5c05c42">Q78: What is a lambda expression?</h4>
<div class="outline-text-4" id="text-org5c05c42">
<p>
A lambda is an inline anonymous function object.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold;">auto</span> <span style="font-weight: bold; font-style: italic;">sq</span> = [](<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">x</span>){ <span style="font-weight: bold;">return</span> x * x; };
</pre>
</div>
</div>
</div>
<div id="outline-container-org541e86a" class="outline-4">
<h4 id="org541e86a">Q79: What is lambda capture?</h4>
<div class="outline-text-4" id="text-org541e86a">
<p>
Capture list defines how outer variables are used inside lambda: by value, by reference, or explicit per-variable capture.
</p>
</div>
</div>
<div id="outline-container-orga4569ff" class="outline-4">
<h4 id="orga4569ff">Q80: What is a mutable lambda?</h4>
<div class="outline-text-4" id="text-orga4569ff">
<p>
It allows modification of by-value captured variables inside the lambda body.
</p>
</div>
</div>
<div id="outline-container-org047575a" class="outline-4">
<h4 id="org047575a">Q81: What is <code>std::function</code>?</h4>
<div class="outline-text-4" id="text-org047575a">
<p>
A type-erased callable wrapper for storing any compatible callable target.
</p>
</div>
</div>
<div id="outline-container-org48292f9" class="outline-4">
<h4 id="org48292f9">Q82: What is the cost of <code>std::function</code>?</h4>
<div class="outline-text-4" id="text-org48292f9">
<p>
It may add indirection and potential allocations.  
For hot paths, templates/auto callables can be cheaper.
</p>
</div>
</div>
<div id="outline-container-orgfa122b9" class="outline-4">
<h4 id="orgfa122b9">Q83: What is <code>std::bind</code>?</h4>
<div class="outline-text-4" id="text-orgfa122b9">
<p>
<code>std::bind</code> creates adapted callables by binding arguments; lambdas are usually clearer in modern code.
</p>
</div>
</div>
<div id="outline-container-org3b87431" class="outline-4">
<h4 id="org3b87431">Q84: What is <code>enum class</code>?</h4>
<div class="outline-text-4" id="text-org3b87431">
<p>
A scoped, strongly typed enum that avoids implicit conversions and name pollution.
</p>
</div>
</div>
<div id="outline-container-org07269b1" class="outline-4">
<h4 id="org07269b1">Q85: Why use <code>enum class</code> over <code>enum</code>?</h4>
<div class="outline-text-4" id="text-org07269b1">
<p>
Better type safety, clearer intent, and reduced accidental misuse.
</p>
</div>
</div>
<div id="outline-container-org52efe35" class="outline-4">
<h4 id="org52efe35">Q86: What is <code>friend</code> in C++?</h4>
<div class="outline-text-4" id="text-org52efe35">
<p>
<code>friend</code> grants selected external functions/classes access to private/protected members.
</p>
</div>
</div>
<div id="outline-container-org4c30000" class="outline-4">
<h4 id="org4c30000">Q87: What is operator overloading?</h4>
<div class="outline-text-4" id="text-org4c30000">
<p>
Defining custom behavior for operators on user-defined types.
</p>
</div>
</div>
<div id="outline-container-org85828cd" class="outline-4">
<h4 id="org85828cd">Q88: Which operators should be overloaded carefully?</h4>
<div class="outline-text-4" id="text-org85828cd">
<p>
Operators such as <code>&amp;&amp;</code>, <code>||</code>, comma, address-of, and implicit conversion operators can be surprising if misused.
</p>
</div>
</div>
