org/posts/cpp.org
*** Q89: Why overload ~<<~ for printing?
 It integrates custom types naturally with stream-based output.

#+begin_src cpp
std::ostream& operator<<(std::ostream& os, const T& t);
#+end_src

*** Q90: What is an explicit constructor?
 It prevents unintended implicit conversions from constructor argument types.

*** Q91: What is a conversion operator?
 A member function that converts an object to another type; should often be ~explicit~.

*** Q92: What is object slicing?
 Copying a derived object by value into a base object drops derived-specific data/behavior.

*** Q93: How to avoid slicing?
 Use references or pointers (preferably smart pointers) for polymorphic objects.

*** Q94: What is inheritance?
 Inheritance creates a derived class that reuses/extents behavior of a base class.

*** Q95: What is polymorphism?
 Polymorphism allows one interface to represent different concrete behaviors.

*** Q96: What is a virtual function?
 A virtual function is dispatched at runtime based on the object’s dynamic type.

*** Q97: Why virtual destructor in polymorphic base?
 It ensures proper derived cleanup when deleting through a base-class pointer.

*** Q98: What does ~override~ mean?
 ~override~ asks compiler to verify that the function actually overrides a base virtual function.

#+begin_src cpp
void foo() override;
#+end_src

*** Q99: What does ~final~ mean?
 It blocks further overriding (for methods) or inheritance (for classes).

*** Q100: What is an abstract class?
 A class with at least one pure virtual function.  
 It defines an interface and cannot be instantiated directly.
 
** Advanced Level

*** Q101: What is multiple inheritance?
 Multiple inheritance means a class derives from more than one base class.  
 It is useful when a type naturally combines behaviors from separate interfaces, but it must be designed carefully to avoid ambiguity.

*** Q102: What is the diamond problem?
 The diamond problem appears when two base classes inherit from the same ancestor, and a derived class inherits from both.  
 Without special handling, the derived class may end up with duplicate base subobjects and ambiguous member access.

*** Q103: What is virtual inheritance?
 Virtual inheritance ensures only one shared instance of a common base exists in diamond-shaped hierarchies.  
 It solves duplication and ambiguity caused by multiple inheritance.

*** Q104: When should composition be preferred over inheritance?
 Prefer composition when you want flexibility, loose coupling, and easier maintenance.  
 Use inheritance mainly when there is a true and stable “is-a” relationship.

*** Q105: What is the pImpl idiom?
 pImpl (Pointer to Implementation) separates interface from implementation details by storing implementation in a private pointer.  
 This hides internal dependencies and reduces header exposure.

*** Q106: What are the benefits of pImpl?
 Main benefits are ABI stability, faster incremental builds, and cleaner encapsulation.  
 It also helps reduce recompilation impact when implementation changes.

*** Q107: What is the One Definition Rule (ODR)?
 ODR requires certain entities (like classes, inline functions, templates) to have one consistent definition across the program.  
 Violating ODR leads to undefined behavior and very hard-to-debug issues.

*** Q108: What is a translation unit in C++?
 A translation unit is a source file after preprocessing (after includes/macros are expanded).  
 Each translation unit is compiled separately before linking.

*** Q109: What is linkage (internal vs external)?
 Linkage defines whether a symbol is visible across translation units.  
 Internal linkage limits visibility to one translation unit; external linkage allows cross-file linking.

*** Q110: What is static storage duration?
 Objects with static storage duration exist for the entire lifetime of the program.  
 They are created before main (or on first use for local statics) and destroyed at program shutdown.

*** Q111: What is thread storage duration?
 Thread storage duration means each thread gets its own instance of a variable, usually with ~thread_local~.  
 The variable lives as long as the thread lives.

*** Q112: What is dynamic storage duration?
 Dynamic storage duration refers to objects created at runtime (e.g., ~new~, allocators, smart pointers).  
 Their lifetime is controlled explicitly or by owning objects.

*** Q113: What is the static initialization order fiasco?
 It is the risk that globals in different translation units initialize in unspecified order.  
 If one global depends on another not yet initialized, behavior can fail unpredictably.

*** Q114: How do you mitigate static initialization order issues?
 Use function-local statics (“construct on first use”), dependency injection, and avoid cross-global dependencies.  
 These techniques make initialization order explicit and safer.

*** Q115: Are function-local statics thread-safe?
 Yes. Since C++11, initialization of function-local statics is guaranteed to be thread-safe.

*** Q116: What is undefined behavior (UB) in C++?
 UB is behavior the C++ standard does not define.  
 If UB occurs, the compiler may assume it never happens, causing arbitrary results.

