public/posts/cpp.html
<div id="outline-container-org29dd956" class="outline-4">
<h4 id="org29dd956">Q89: Why overload <code>&lt;&lt;</code> for printing?</h4>
<div class="outline-text-4" id="text-org29dd956">
<p>
It integrates custom types naturally with stream-based output.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">ostream</span>&amp; <span style="font-weight: bold;">operator</span><span style="font-weight: bold;">&lt;&lt;</span>(<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">ostream</span>&amp; <span style="font-weight: bold; font-style: italic;">os</span>, <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">T</span>&amp; <span style="font-weight: bold; font-style: italic;">t</span>);
</pre>
</div>
</div>
</div>
<div id="outline-container-org9bd9665" class="outline-4">
<h4 id="org9bd9665">Q90: What is an explicit constructor?</h4>
<div class="outline-text-4" id="text-org9bd9665">
<p>
It prevents unintended implicit conversions from constructor argument types.
</p>
</div>
</div>
<div id="outline-container-orgc9cc18d" class="outline-4">
<h4 id="orgc9cc18d">Q91: What is a conversion operator?</h4>
<div class="outline-text-4" id="text-orgc9cc18d">
<p>
A member function that converts an object to another type; should often be <code>explicit</code>.
</p>
</div>
</div>
<div id="outline-container-orgade5e65" class="outline-4">
<h4 id="orgade5e65">Q92: What is object slicing?</h4>
<div class="outline-text-4" id="text-orgade5e65">
<p>
Copying a derived object by value into a base object drops derived-specific data/behavior.
</p>
</div>
</div>
<div id="outline-container-org30ceb96" class="outline-4">
<h4 id="org30ceb96">Q93: How to avoid slicing?</h4>
<div class="outline-text-4" id="text-org30ceb96">
<p>
Use references or pointers (preferably smart pointers) for polymorphic objects.
</p>
</div>
</div>
<div id="outline-container-org3305826" class="outline-4">
<h4 id="org3305826">Q94: What is inheritance?</h4>
<div class="outline-text-4" id="text-org3305826">
<p>
Inheritance creates a derived class that reuses/extents behavior of a base class.
</p>
</div>
</div>
<div id="outline-container-org7686e87" class="outline-4">
<h4 id="org7686e87">Q95: What is polymorphism?</h4>
<div class="outline-text-4" id="text-org7686e87">
<p>
Polymorphism allows one interface to represent different concrete behaviors.
</p>
</div>
</div>
<div id="outline-container-org20f8165" class="outline-4">
<h4 id="org20f8165">Q96: What is a virtual function?</h4>
<div class="outline-text-4" id="text-org20f8165">
<p>
A virtual function is dispatched at runtime based on the object’s dynamic type.
</p>
</div>
</div>
<div id="outline-container-orgffb0ab2" class="outline-4">
<h4 id="orgffb0ab2">Q97: Why virtual destructor in polymorphic base?</h4>
<div class="outline-text-4" id="text-orgffb0ab2">
<p>
It ensures proper derived cleanup when deleting through a base-class pointer.
</p>
</div>
</div>
<div id="outline-container-orga81c38e" class="outline-4">
<h4 id="orga81c38e">Q98: What does <code>override</code> mean?</h4>
<div class="outline-text-4" id="text-orga81c38e">
<p>
<code>override</code> asks compiler to verify that the function actually overrides a base virtual function.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">foo</span>() <span style="font-weight: bold;">override</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org8bc9a79" class="outline-4">
<h4 id="org8bc9a79">Q99: What does <code>final</code> mean?</h4>
<div class="outline-text-4" id="text-org8bc9a79">
<p>
It blocks further overriding (for methods) or inheritance (for classes).
</p>
</div>
</div>
<div id="outline-container-org282799d" class="outline-4">
<h4 id="org282799d">Q100: What is an abstract class?</h4>
<div class="outline-text-4" id="text-org282799d">
<p>
A class with at least one pure virtual function.  
It defines an interface and cannot be instantiated directly.
</p>
</div>
</div>
</div>
<div id="outline-container-org8fe0479" class="outline-3">
<h3 id="org8fe0479">Advanced Level</h3>
<div class="outline-text-3" id="text-org8fe0479">
</div>
<div id="outline-container-org1c74a4b" class="outline-4">
<h4 id="org1c74a4b">Q101: What is multiple inheritance?</h4>
<div class="outline-text-4" id="text-org1c74a4b">
<p>
Multiple inheritance means a class derives from more than one base class.  
It is useful when a type naturally combines behaviors from separate interfaces, but it must be designed carefully to avoid ambiguity.
</p>
</div>
</div>
<div id="outline-container-org5df768e" class="outline-4">
<h4 id="org5df768e">Q102: What is the diamond problem?</h4>
<div class="outline-text-4" id="text-org5df768e">
<p>
The diamond problem appears when two base classes inherit from the same ancestor, and a derived class inherits from both.  
Without special handling, the derived class may end up with duplicate base subobjects and ambiguous member access.
</p>
</div>
</div>
<div id="outline-container-org33a1d0a" class="outline-4">
<h4 id="org33a1d0a">Q103: What is virtual inheritance?</h4>
<div class="outline-text-4" id="text-org33a1d0a">
<p>
Virtual inheritance ensures only one shared instance of a common base exists in diamond-shaped hierarchies.  
It solves duplication and ambiguity caused by multiple inheritance.
</p>
</div>
</div>
<div id="outline-container-org77852c3" class="outline-4">
<h4 id="org77852c3">Q104: When should composition be preferred over inheritance?</h4>
<div class="outline-text-4" id="text-org77852c3">
<p>
Prefer composition when you want flexibility, loose coupling, and easier maintenance.  
Use inheritance mainly when there is a true and stable “is-a” relationship.
</p>
</div>
</div>
<div id="outline-container-org03aca42" class="outline-4">
<h4 id="org03aca42">Q105: What is the pImpl idiom?</h4>
<div class="outline-text-4" id="text-org03aca42">
<p>
pImpl (Pointer to Implementation) separates interface from implementation details by storing implementation in a private pointer.  
This hides internal dependencies and reduces header exposure.
</p>
</div>
</div>
<div id="outline-container-org635097c" class="outline-4">
<h4 id="org635097c">Q106: What are the benefits of pImpl?</h4>
<div class="outline-text-4" id="text-org635097c">
<p>
Main benefits are ABI stability, faster incremental builds, and cleaner encapsulation.  
It also helps reduce recompilation impact when implementation changes.
</p>
</div>
</div>
<div id="outline-container-orgb5f6d19" class="outline-4">
<h4 id="orgb5f6d19">Q107: What is the One Definition Rule (ODR)?</h4>
<div class="outline-text-4" id="text-orgb5f6d19">
<p>
ODR requires certain entities (like classes, inline functions, templates) to have one consistent definition across the program.  
Violating ODR leads to undefined behavior and very hard-to-debug issues.
</p>
</div>
</div>
<div id="outline-container-orgd9b28c8" class="outline-4">
<h4 id="orgd9b28c8">Q108: What is a translation unit in C++?</h4>
<div class="outline-text-4" id="text-orgd9b28c8">
<p>
A translation unit is a source file after preprocessing (after includes/macros are expanded).  
Each translation unit is compiled separately before linking.
</p>
</div>
</div>
<div id="outline-container-orga869cf7" class="outline-4">
<h4 id="orga869cf7">Q109: What is linkage (internal vs external)?</h4>
<div class="outline-text-4" id="text-orga869cf7">
<p>
Linkage defines whether a symbol is visible across translation units.  
Internal linkage limits visibility to one translation unit; external linkage allows cross-file linking.
</p>
</div>
</div>
<div id="outline-container-org9bbf757" class="outline-4">
<h4 id="org9bbf757">Q110: What is static storage duration?</h4>
<div class="outline-text-4" id="text-org9bbf757">
<p>
Objects with static storage duration exist for the entire lifetime of the program.  
They are created before main (or on first use for local statics) and destroyed at program shutdown.
</p>
</div>
</div>
<div id="outline-container-org3d101b3" class="outline-4">
<h4 id="org3d101b3">Q111: What is thread storage duration?</h4>
<div class="outline-text-4" id="text-org3d101b3">
<p>
Thread storage duration means each thread gets its own instance of a variable, usually with <code>thread_local</code>.  
The variable lives as long as the thread lives.
</p>
</div>
</div>
<div id="outline-container-orge260ac9" class="outline-4">
<h4 id="orge260ac9">Q112: What is dynamic storage duration?</h4>
<div class="outline-text-4" id="text-orge260ac9">
<p>
Dynamic storage duration refers to objects created at runtime (e.g., <code>new</code>, allocators, smart pointers).  
Their lifetime is controlled explicitly or by owning objects.
</p>
</div>
</div>
<div id="outline-container-org73bd09a" class="outline-4">
<h4 id="org73bd09a">Q113: What is the static initialization order fiasco?</h4>
<div class="outline-text-4" id="text-org73bd09a">
<p>
It is the risk that globals in different translation units initialize in unspecified order.  
If one global depends on another not yet initialized, behavior can fail unpredictably.
</p>
</div>
</div>
<div id="outline-container-org93cafd6" class="outline-4">
<h4 id="org93cafd6">Q114: How do you mitigate static initialization order issues?</h4>
<div class="outline-text-4" id="text-org93cafd6">
<p>
Use function-local statics (“construct on first use”), dependency injection, and avoid cross-global dependencies.  
These techniques make initialization order explicit and safer.
</p>
</div>
</div>
<div id="outline-container-org2019916" class="outline-4">
<h4 id="org2019916">Q115: Are function-local statics thread-safe?</h4>
<div class="outline-text-4" id="text-org2019916">
<p>
Yes. Since C++11, initialization of function-local statics is guaranteed to be thread-safe.
</p>
</div>
</div>
<div id="outline-container-org7e85c2d" class="outline-4">
<h4 id="org7e85c2d">Q116: What is undefined behavior (UB) in C++?</h4>
<div class="outline-text-4" id="text-org7e85c2d">
<p>
UB is behavior the C++ standard does not define.  
If UB occurs, the compiler may assume it never happens, causing arbitrary results.
</p>
</div>
</div>
