org/posts/cpp.org
*** Q117: Common UB examples in C++?
 Typical examples: out-of-bounds access, use-after-free, data races, signed overflow, invalid pointer casts.  
 Even if code “seems to work,” UB can break under optimization or platform changes.

*** Q118: What is implementation-defined behavior?
 Behavior where the compiler/platform must choose a rule and document it.  
 Example: exact sizes of some integer types on a given target.

*** Q119: What is unspecified behavior?
 Behavior where multiple outcomes are allowed and no single outcome must be documented for every run.  
 The program stays valid, but exact result may vary.

*** Q120: What are strict aliasing rules?
 Strict aliasing limits accessing an object through unrelated types.  
 Breaking these rules can produce UB and surprising optimizer miscompilations.

*** Q121: What is alignment?
 Alignment is a type’s required memory boundary (e.g., 4-byte or 8-byte boundary).  
 Proper alignment is important for correctness and performance.

*** Q122: What is ~alignas~?
 ~alignas~ requests a specific alignment for a type or object.

#+begin_src cpp
struct alignas(64) CacheLineData { int x; };
#+end_src

*** Q123: What is a constexpr function?
 A ~constexpr~ function can be evaluated at compile time when called with constant-expression inputs.  
 It can also run at runtime when compile-time evaluation is not required.

*** Q124: What is ~consteval~?
 A ~consteval~ function must always be evaluated at compile time.  
 If compile-time evaluation is not possible, compilation fails.

*** Q125: What is ~constinit~?
 ~constinit~ ensures a static/thread variable is initialized at compile time (constant initialization), preventing dynamic init surprises.

*** Q126: What are concepts (C++20)?
 Concepts are template constraints that express required properties of template arguments.  
 They improve readability and compiler diagnostics.

*** Q127: Why do concepts help large codebases?
 They produce earlier and clearer errors, make template APIs self-documenting, and reduce cryptic substitution failures.

*** Q128: What is a requires clause?
 A ~requires~ clause attaches constraints to templates/functions so they participate only when requirements are met.

*** Q129: What is SFINAE?
 SFINAE means “Substitution Failure Is Not An Error.”  
 In older template style, invalid substitutions remove candidates instead of hard-failing compilation.

*** Q130: What is CRTP?
 CRTP (Curiously Recurring Template Pattern) is when a class template takes the derived class as a parameter.  
 It enables static polymorphism and compile-time customization.

*** Q131: Static vs dynamic polymorphism?
- Static polymorphism: resolved at compile time (templates/CRTP), often zero-overhead
- Dynamic polymorphism: resolved at runtime via virtual dispatch

*** Q132: What is type erasure?
 Type erasure hides concrete types behind a common interface (e.g., ~std::function~).  
 It improves flexibility at some runtime cost.

*** Q133: What is ~std::any~?
 ~std::any~ stores one value of any copyable type with type-safe retrieval via ~std::any_cast~.

*** Q134: What is ~std::variant~?
 ~std::variant~ is a type-safe tagged union storing exactly one value from a fixed set of types.

*** Q135: What is ~std::optional~?
 ~std::optional<T>~ represents either “a ~T~ value” or “no value,” without using pointers or magic sentinels.

*** Q136: Why use optional instead of sentinel values?
 It makes absence explicit in the type system, improving correctness and readability.

*** Q137: What is ~std::span~?
 ~std::span~ is a lightweight non-owning view over contiguous memory (pointer + length).  
 It is useful for passing arrays/vectors safely without copying.

*** Q138: What is ~std::string_view~?
 ~std::string_view~ is a non-owning read-only view into character data.  
 It avoids allocation and copying for many APIs.

*** Q139: What is a common pitfall with ~string_view~?
 Lifetime issues: if the original string/buffer dies or changes, the view may dangle and become invalid.

*** Q140: What is the ranges library?
 C++ ranges provide composable views and algorithms with pipeline-style syntax, often clearer and lazier than manual loops.

*** Q141: What is a coroutine (C++20)?
 Coroutines are language-level suspend/resume functions for async workflows, generators, and cooperative tasks.

*** Q142: Are coroutines threads?
 No. Coroutines are control-flow constructs; scheduling/execution (threaded or not) depends on library/runtime design.

*** Q143: What is a move-only type?
 A move-only type supports move operations but not copy operations (example: ~std::unique_ptr~).

*** Q144: Why is ~unique_ptr~ move-only?
 To enforce exclusive ownership so exactly one owner controls resource lifetime.

*** Q145: What is ~shared_ptr~?
 ~std::shared_ptr~ provides shared ownership via reference counting.  
 The managed object is destroyed when the last owner is gone.

*** Q146: What is ~weak_ptr~?
 ~std::weak_ptr~ observes an object managed by ~shared_ptr~ without extending its lifetime.

*** Q147: What is a ~shared_ptr~ cycle?
 A cycle happens when objects hold shared ownership of each other; reference counts never reach zero, so destruction never occurs.

