public/posts/cpp.html
<div id="outline-container-org99776b7" class="outline-4">
<h4 id="org99776b7">Q117: Common UB examples in C++?</h4>
<div class="outline-text-4" id="text-org99776b7">
<p>
Typical examples: out-of-bounds access, use-after-free, data races, signed overflow, invalid pointer casts.  
Even if code “seems to work,” UB can break under optimization or platform changes.
</p>
</div>
</div>
<div id="outline-container-orgf16af38" class="outline-4">
<h4 id="orgf16af38">Q118: What is implementation-defined behavior?</h4>
<div class="outline-text-4" id="text-orgf16af38">
<p>
Behavior where the compiler/platform must choose a rule and document it.  
Example: exact sizes of some integer types on a given target.
</p>
</div>
</div>
<div id="outline-container-org0cf4e9f" class="outline-4">
<h4 id="org0cf4e9f">Q119: What is unspecified behavior?</h4>
<div class="outline-text-4" id="text-org0cf4e9f">
<p>
Behavior where multiple outcomes are allowed and no single outcome must be documented for every run.  
The program stays valid, but exact result may vary.
</p>
</div>
</div>
<div id="outline-container-org6fd9607" class="outline-4">
<h4 id="org6fd9607">Q120: What are strict aliasing rules?</h4>
<div class="outline-text-4" id="text-org6fd9607">
<p>
Strict aliasing limits accessing an object through unrelated types.  
Breaking these rules can produce UB and surprising optimizer miscompilations.
</p>
</div>
</div>
<div id="outline-container-orgafee01c" class="outline-4">
<h4 id="orgafee01c">Q121: What is alignment?</h4>
<div class="outline-text-4" id="text-orgafee01c">
<p>
Alignment is a type’s required memory boundary (e.g., 4-byte or 8-byte boundary).  
Proper alignment is important for correctness and performance.
</p>
</div>
</div>
<div id="outline-container-orgacf8de8" class="outline-4">
<h4 id="orgacf8de8">Q122: What is <code>alignas</code>?</h4>
<div class="outline-text-4" id="text-orgacf8de8">
<p>
<code>alignas</code> requests a specific alignment for a type or object.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold;">struct</span> <span style="font-weight: bold;">alignas</span>(64) <span style="font-weight: bold; text-decoration: underline;">CacheLineData</span> { <span style="font-weight: bold; text-decoration: underline;">int</span> x; };
</pre>
</div>
</div>
</div>
<div id="outline-container-org2bdb669" class="outline-4">
<h4 id="org2bdb669">Q123: What is a constexpr function?</h4>
<div class="outline-text-4" id="text-org2bdb669">
<p>
A <code>constexpr</code> function can be evaluated at compile time when called with constant-expression inputs.  
It can also run at runtime when compile-time evaluation is not required.
</p>
</div>
</div>
<div id="outline-container-org946b626" class="outline-4">
<h4 id="org946b626">Q124: What is <code>consteval</code>?</h4>
<div class="outline-text-4" id="text-org946b626">
<p>
A <code>consteval</code> function must always be evaluated at compile time.  
If compile-time evaluation is not possible, compilation fails.
</p>
</div>
</div>
<div id="outline-container-orgf10f4c4" class="outline-4">
<h4 id="orgf10f4c4">Q125: What is <code>constinit</code>?</h4>
<div class="outline-text-4" id="text-orgf10f4c4">
<p>
<code>constinit</code> ensures a static/thread variable is initialized at compile time (constant initialization), preventing dynamic init surprises.
</p>
</div>
</div>
<div id="outline-container-org5685769" class="outline-4">
<h4 id="org5685769">Q126: What are concepts (C++20)?</h4>
<div class="outline-text-4" id="text-org5685769">
<p>
Concepts are template constraints that express required properties of template arguments.  
They improve readability and compiler diagnostics.
</p>
</div>
</div>
<div id="outline-container-orgdb5fc99" class="outline-4">
<h4 id="orgdb5fc99">Q127: Why do concepts help large codebases?</h4>
<div class="outline-text-4" id="text-orgdb5fc99">
<p>
They produce earlier and clearer errors, make template APIs self-documenting, and reduce cryptic substitution failures.
</p>
</div>
</div>
<div id="outline-container-org29fbf9f" class="outline-4">
<h4 id="org29fbf9f">Q128: What is a requires clause?</h4>
<div class="outline-text-4" id="text-org29fbf9f">
<p>
A <code>requires</code> clause attaches constraints to templates/functions so they participate only when requirements are met.
</p>
</div>
</div>
<div id="outline-container-orgfed5bbe" class="outline-4">
<h4 id="orgfed5bbe">Q129: What is SFINAE?</h4>
<div class="outline-text-4" id="text-orgfed5bbe">
<p>
SFINAE means “Substitution Failure Is Not An Error.”  
In older template style, invalid substitutions remove candidates instead of hard-failing compilation.
</p>
</div>
</div>
<div id="outline-container-org23521cc" class="outline-4">
<h4 id="org23521cc">Q130: What is CRTP?</h4>
<div class="outline-text-4" id="text-org23521cc">
<p>
CRTP (Curiously Recurring Template Pattern) is when a class template takes the derived class as a parameter.  
It enables static polymorphism and compile-time customization.
</p>
</div>
</div>
<div id="outline-container-org35af3cc" class="outline-4">
<h4 id="org35af3cc">Q131: Static vs dynamic polymorphism?</h4>
<div class="outline-text-4" id="text-org35af3cc">
<ul class="org-ul">
<li>Static polymorphism: resolved at compile time (templates/CRTP), often zero-overhead</li>
<li>Dynamic polymorphism: resolved at runtime via virtual dispatch</li>
</ul>
</div>
</div>
<div id="outline-container-org74783e3" class="outline-4">
<h4 id="org74783e3">Q132: What is type erasure?</h4>
<div class="outline-text-4" id="text-org74783e3">
<p>
Type erasure hides concrete types behind a common interface (e.g., <code>std::function</code>).  
It improves flexibility at some runtime cost.
</p>
</div>
</div>
<div id="outline-container-orgb1fb918" class="outline-4">
<h4 id="orgb1fb918">Q133: What is <code>std::any</code>?</h4>
<div class="outline-text-4" id="text-orgb1fb918">
<p>
<code>std::any</code> stores one value of any copyable type with type-safe retrieval via <code>std::any_cast</code>.
</p>
</div>
</div>
<div id="outline-container-org0ca260c" class="outline-4">
<h4 id="org0ca260c">Q134: What is <code>std::variant</code>?</h4>
<div class="outline-text-4" id="text-org0ca260c">
<p>
<code>std::variant</code> is a type-safe tagged union storing exactly one value from a fixed set of types.
</p>
</div>
</div>
<div id="outline-container-org034ac67" class="outline-4">
<h4 id="org034ac67">Q135: What is <code>std::optional</code>?</h4>
<div class="outline-text-4" id="text-org034ac67">
<p>
<code>std::optional&lt;T&gt;</code> represents either “a <code>T</code> value” or “no value,” without using pointers or magic sentinels.
</p>
</div>
</div>
<div id="outline-container-org0febc3a" class="outline-4">
<h4 id="org0febc3a">Q136: Why use optional instead of sentinel values?</h4>
<div class="outline-text-4" id="text-org0febc3a">
<p>
It makes absence explicit in the type system, improving correctness and readability.
</p>
</div>
</div>
<div id="outline-container-orga4ed33e" class="outline-4">
<h4 id="orga4ed33e">Q137: What is <code>std::span</code>?</h4>
<div class="outline-text-4" id="text-orga4ed33e">
<p>
<code>std::span</code> is a lightweight non-owning view over contiguous memory (pointer + length).  
It is useful for passing arrays/vectors safely without copying.
</p>
</div>
</div>
<div id="outline-container-orgf228c31" class="outline-4">
<h4 id="orgf228c31">Q138: What is <code>std::string_view</code>?</h4>
<div class="outline-text-4" id="text-orgf228c31">
<p>
<code>std::string_view</code> is a non-owning read-only view into character data.  
It avoids allocation and copying for many APIs.
</p>
</div>
</div>
<div id="outline-container-orgd5315ba" class="outline-4">
<h4 id="orgd5315ba">Q139: What is a common pitfall with <code>string_view</code>?</h4>
<div class="outline-text-4" id="text-orgd5315ba">
<p>
Lifetime issues: if the original string/buffer dies or changes, the view may dangle and become invalid.
</p>
</div>
</div>
<div id="outline-container-orgd505b59" class="outline-4">
<h4 id="orgd505b59">Q140: What is the ranges library?</h4>
<div class="outline-text-4" id="text-orgd505b59">
<p>
C++ ranges provide composable views and algorithms with pipeline-style syntax, often clearer and lazier than manual loops.
</p>
</div>
</div>
<div id="outline-container-org55df61e" class="outline-4">
<h4 id="org55df61e">Q141: What is a coroutine (C++20)?</h4>
<div class="outline-text-4" id="text-org55df61e">
<p>
Coroutines are language-level suspend/resume functions for async workflows, generators, and cooperative tasks.
</p>
</div>
</div>
<div id="outline-container-org6dd049c" class="outline-4">
<h4 id="org6dd049c">Q142: Are coroutines threads?</h4>
<div class="outline-text-4" id="text-org6dd049c">
<p>
No. Coroutines are control-flow constructs; scheduling/execution (threaded or not) depends on library/runtime design.
</p>
</div>
</div>
<div id="outline-container-org4bd1be9" class="outline-4">
<h4 id="org4bd1be9">Q143: What is a move-only type?</h4>
<div class="outline-text-4" id="text-org4bd1be9">
<p>
A move-only type supports move operations but not copy operations (example: <code>std::unique_ptr</code>).
</p>
</div>
</div>
<div id="outline-container-org41bd627" class="outline-4">
<h4 id="org41bd627">Q144: Why is <code>unique_ptr</code> move-only?</h4>
<div class="outline-text-4" id="text-org41bd627">
<p>
To enforce exclusive ownership so exactly one owner controls resource lifetime.
</p>
</div>
</div>
<div id="outline-container-orga1078c9" class="outline-4">
<h4 id="orga1078c9">Q145: What is <code>shared_ptr</code>?</h4>
<div class="outline-text-4" id="text-orga1078c9">
<p>
<code>std::shared_ptr</code> provides shared ownership via reference counting.  
The managed object is destroyed when the last owner is gone.
</p>
</div>
</div>
<div id="outline-container-org2c00ca5" class="outline-4">
<h4 id="org2c00ca5">Q146: What is <code>weak_ptr</code>?</h4>
<div class="outline-text-4" id="text-org2c00ca5">
<p>
<code>std::weak_ptr</code> observes an object managed by <code>shared_ptr</code> without extending its lifetime.
</p>
</div>
</div>
<div id="outline-container-org1a2ec95" class="outline-4">
<h4 id="org1a2ec95">Q147: What is a <code>shared_ptr</code> cycle?</h4>
<div class="outline-text-4" id="text-org1a2ec95">
<p>
A cycle happens when objects hold shared ownership of each other; reference counts never reach zero, so destruction never occurs.
</p>
</div>
</div>
