org/posts/cpp.org
*** Q148: How do you break ~shared_ptr~ cycles?
 Use ~std::weak_ptr~ in at least one direction of cyclic relationships.

*** Q149: Why use ~make_unique~ / ~make_shared~?
 They are safer and cleaner. ~make_shared~ can be more efficient due to single allocation for control block + object.

*** Q150: What is a custom deleter?
 A custom deleter is a callable that defines how a smart pointer releases its resource.

** Expert Level

*** Q151: What are exception safety guarantee levels?
- Basic guarantee: program remains valid; no leaks; invariants preserved
- Strong guarantee: operation is transactional (commit-or-rollback)
- Nothrow guarantee: operation never throws exceptions

*** Q152: What is copy-and-swap idiom?
 It implements assignment by copying into a temporary and swapping.  
 This centralizes logic and often provides strong exception safety.

*** Q153: What is an allocator in STL?
 An allocator controls how container memory is allocated/deallocated.  
 It is a policy customization point for memory behavior.

*** Q154: Why use custom allocators?
 For domain-specific performance, reduced fragmentation, custom pools, and memory tracking/constraints.

*** Q155: What is PMR (Polymorphic Memory Resource)?
 PMR (~<memory_resource>~) provides runtime-selectable allocation strategies without changing container element types.

*** Q156: What is cache-friendly data layout?
 It means arranging data to improve locality so CPU caches are used effectively, reducing stalls and misses.

*** Q157: What is false sharing in multithreading?
 False sharing occurs when different threads write unrelated variables on the same cache line, causing heavy coherence traffic.

*** Q158: How can false sharing be reduced?
 Use padding/alignment, separate hot writable fields, and shard per-thread data.

*** Q159: What is the C++ memory model?
 It defines rules for atomic operations, synchronization, visibility, and ordering between threads.

*** Q160: What are atomic memory orders?
 ~relaxed~, ~acquire~, ~release~, ~acq_rel~, ~seq_cst~ (and ~consume~, rarely used in practice).  
 They trade off ordering guarantees vs performance.

*** Q161: When use relaxed atomics?
 When only atomicity is needed and no cross-thread ordering/synchronization is required.

*** Q162: Why is ~seq_cst~ easiest to reason about?
 It provides a single global order for sequentially consistent operations, making mental models simpler.

*** Q163: What is a data race in C++?
 Conflicting unsynchronized accesses to the same memory location (at least one write, non-atomic) cause UB.

*** Q164: Is ~volatile~ for thread synchronization?
 No. ~volatile~ is not a synchronization primitive. Use atomics, mutexes, and condition variables.

*** Q165: What is a mutex?
 A mutex enforces mutual exclusion so only one thread enters a critical section at a time.

*** Q166: What is ~lock_guard~?
 ~std::lock_guard~ is an RAII lock wrapper: locks on construction, unlocks on destruction.

*** Q167: What is ~unique_lock~?
 ~std::unique_lock~ is a flexible lock wrapper supporting deferred locking, manual unlock/relock, and condition-variable waits.

*** Q168: What is deadlock?
 Deadlock is when threads wait on each other indefinitely due to cyclic lock dependencies.

*** Q169: Basic deadlock prevention strategies?
 Keep consistent lock ordering, reduce lock nesting, and use helpers like ~std::scoped_lock~ for multi-lock acquisition.

*** Q170: What is ~condition_variable~?
 A synchronization primitive that blocks threads until notified and a condition becomes true.

*** Q171: Why wait with a predicate?
 Predicates protect against spurious wakeups and re-check correctness on wake.

#+begin_src cpp
cv.wait(lock, [&]{ return ready; });
#+end_src

*** Q172: What are ~future~ and ~promise~?
 They provide asynchronous result passing: producer sets result in ~promise~, consumer gets it through ~future~.

*** Q173: What is a ~std::async~ caveat?
 Launch policy matters. Without explicit ~std::launch::async~, execution may be deferred until ~get()/wait()~.

*** Q174: What is the challenge in lock-free programming?
 Correctness is very hard: memory ordering, ABA, reclamation, and subtle race bugs make design complex.

*** Q175: What is the ABA problem?
 A CAS check sees value A again and assumes nothing changed, even though state changed A→B→A in between.

*** Q176: What are hazard pointers / epoch reclamation?
 They are strategies for safe memory reclamation in lock-free structures, preventing reclamation while data may still be observed.

*** Q177: What are modules in C++20?
 Modules are a modern alternative to textual headers, improving compile scalability and dependency hygiene.

*** Q178: Benefits of modules over headers?
 Faster builds, better encapsulation, and less macro/definition leakage across boundaries.

*** Q179: What is the role of a build system in C++?
 It manages compilation units, dependencies, flags, linking, and test/build orchestration across environments.

*** Q180: Why compile with high warning levels?
 Warnings catch bugs early, enforce consistency, and improve long-term code quality.

