public/posts/cpp.html
<div id="outline-container-org895efcf" class="outline-4">
<h4 id="org895efcf">Q148: How do you break <code>shared_ptr</code> cycles?</h4>
<div class="outline-text-4" id="text-org895efcf">
<p>
Use <code>std::weak_ptr</code> in at least one direction of cyclic relationships.
</p>
</div>
</div>
<div id="outline-container-orga128577" class="outline-4">
<h4 id="orga128577">Q149: Why use <code>make_unique</code> / <code>make_shared</code>?</h4>
<div class="outline-text-4" id="text-orga128577">
<p>
They are safer and cleaner. <code>make_shared</code> can be more efficient due to single allocation for control block + object.
</p>
</div>
</div>
<div id="outline-container-orgbe26eee" class="outline-4">
<h4 id="orgbe26eee">Q150: What is a custom deleter?</h4>
<div class="outline-text-4" id="text-orgbe26eee">
<p>
A custom deleter is a callable that defines how a smart pointer releases its resource.
</p>
</div>
</div>
</div>
<div id="outline-container-org195de3f" class="outline-3">
<h3 id="org195de3f">Expert Level</h3>
<div class="outline-text-3" id="text-org195de3f">
</div>
<div id="outline-container-orge8396a2" class="outline-4">
<h4 id="orge8396a2">Q151: What are exception safety guarantee levels?</h4>
<div class="outline-text-4" id="text-orge8396a2">
<ul class="org-ul">
<li>Basic guarantee: program remains valid; no leaks; invariants preserved</li>
<li>Strong guarantee: operation is transactional (commit-or-rollback)</li>
<li>Nothrow guarantee: operation never throws exceptions</li>
</ul>
</div>
</div>
<div id="outline-container-org50a5e97" class="outline-4">
<h4 id="org50a5e97">Q152: What is copy-and-swap idiom?</h4>
<div class="outline-text-4" id="text-org50a5e97">
<p>
It implements assignment by copying into a temporary and swapping.  
This centralizes logic and often provides strong exception safety.
</p>
</div>
</div>
<div id="outline-container-orgc9e145b" class="outline-4">
<h4 id="orgc9e145b">Q153: What is an allocator in STL?</h4>
<div class="outline-text-4" id="text-orgc9e145b">
<p>
An allocator controls how container memory is allocated/deallocated.  
It is a policy customization point for memory behavior.
</p>
</div>
</div>
<div id="outline-container-org9806de6" class="outline-4">
<h4 id="org9806de6">Q154: Why use custom allocators?</h4>
<div class="outline-text-4" id="text-org9806de6">
<p>
For domain-specific performance, reduced fragmentation, custom pools, and memory tracking/constraints.
</p>
</div>
</div>
<div id="outline-container-org68c722a" class="outline-4">
<h4 id="org68c722a">Q155: What is PMR (Polymorphic Memory Resource)?</h4>
<div class="outline-text-4" id="text-org68c722a">
<p>
PMR (<code>&lt;memory_resource&gt;</code>) provides runtime-selectable allocation strategies without changing container element types.
</p>
</div>
</div>
<div id="outline-container-org897b572" class="outline-4">
<h4 id="org897b572">Q156: What is cache-friendly data layout?</h4>
<div class="outline-text-4" id="text-org897b572">
<p>
It means arranging data to improve locality so CPU caches are used effectively, reducing stalls and misses.
</p>
</div>
</div>
<div id="outline-container-org9af1c12" class="outline-4">
<h4 id="org9af1c12">Q157: What is false sharing in multithreading?</h4>
<div class="outline-text-4" id="text-org9af1c12">
<p>
False sharing occurs when different threads write unrelated variables on the same cache line, causing heavy coherence traffic.
</p>
</div>
</div>
<div id="outline-container-org8b84bb2" class="outline-4">
<h4 id="org8b84bb2">Q158: How can false sharing be reduced?</h4>
<div class="outline-text-4" id="text-org8b84bb2">
<p>
Use padding/alignment, separate hot writable fields, and shard per-thread data.
</p>
</div>
</div>
<div id="outline-container-orgdded9ef" class="outline-4">
<h4 id="orgdded9ef">Q159: What is the C++ memory model?</h4>
<div class="outline-text-4" id="text-orgdded9ef">
<p>
It defines rules for atomic operations, synchronization, visibility, and ordering between threads.
</p>
</div>
</div>
<div id="outline-container-org0dd403f" class="outline-4">
<h4 id="org0dd403f">Q160: What are atomic memory orders?</h4>
<div class="outline-text-4" id="text-org0dd403f">
<p>
<code>relaxed</code>, <code>acquire</code>, <code>release</code>, <code>acq_rel</code>, <code>seq_cst</code> (and <code>consume</code>, rarely used in practice).  
They trade off ordering guarantees vs performance.
</p>
</div>
</div>
<div id="outline-container-orgcf36a2f" class="outline-4">
<h4 id="orgcf36a2f">Q161: When use relaxed atomics?</h4>
<div class="outline-text-4" id="text-orgcf36a2f">
<p>
When only atomicity is needed and no cross-thread ordering/synchronization is required.
</p>
</div>
</div>
<div id="outline-container-org8374340" class="outline-4">
<h4 id="org8374340">Q162: Why is <code>seq_cst</code> easiest to reason about?</h4>
<div class="outline-text-4" id="text-org8374340">
<p>
It provides a single global order for sequentially consistent operations, making mental models simpler.
</p>
</div>
</div>
<div id="outline-container-orgb886004" class="outline-4">
<h4 id="orgb886004">Q163: What is a data race in C++?</h4>
<div class="outline-text-4" id="text-orgb886004">
<p>
Conflicting unsynchronized accesses to the same memory location (at least one write, non-atomic) cause UB.
</p>
</div>
</div>
<div id="outline-container-org4951c9a" class="outline-4">
<h4 id="org4951c9a">Q164: Is <code>volatile</code> for thread synchronization?</h4>
<div class="outline-text-4" id="text-org4951c9a">
<p>
No. <code>volatile</code> is not a synchronization primitive. Use atomics, mutexes, and condition variables.
</p>
</div>
</div>
<div id="outline-container-org45bb401" class="outline-4">
<h4 id="org45bb401">Q165: What is a mutex?</h4>
<div class="outline-text-4" id="text-org45bb401">
<p>
A mutex enforces mutual exclusion so only one thread enters a critical section at a time.
</p>
</div>
</div>
<div id="outline-container-orgc8ef2cd" class="outline-4">
<h4 id="orgc8ef2cd">Q166: What is <code>lock_guard</code>?</h4>
<div class="outline-text-4" id="text-orgc8ef2cd">
<p>
<code>std::lock_guard</code> is an RAII lock wrapper: locks on construction, unlocks on destruction.
</p>
</div>
</div>
<div id="outline-container-org81af8ed" class="outline-4">
<h4 id="org81af8ed">Q167: What is <code>unique_lock</code>?</h4>
<div class="outline-text-4" id="text-org81af8ed">
<p>
<code>std::unique_lock</code> is a flexible lock wrapper supporting deferred locking, manual unlock/relock, and condition-variable waits.
</p>
</div>
</div>
<div id="outline-container-org829c572" class="outline-4">
<h4 id="org829c572">Q168: What is deadlock?</h4>
<div class="outline-text-4" id="text-org829c572">
<p>
Deadlock is when threads wait on each other indefinitely due to cyclic lock dependencies.
</p>
</div>
</div>
<div id="outline-container-org3d75b32" class="outline-4">
<h4 id="org3d75b32">Q169: Basic deadlock prevention strategies?</h4>
<div class="outline-text-4" id="text-org3d75b32">
<p>
Keep consistent lock ordering, reduce lock nesting, and use helpers like <code>std::scoped_lock</code> for multi-lock acquisition.
</p>
</div>
</div>
<div id="outline-container-org5c66cc9" class="outline-4">
<h4 id="org5c66cc9">Q170: What is <code>condition_variable</code>?</h4>
<div class="outline-text-4" id="text-org5c66cc9">
<p>
A synchronization primitive that blocks threads until notified and a condition becomes true.
</p>
</div>
</div>
<div id="outline-container-orgb085b9b" class="outline-4">
<h4 id="orgb085b9b">Q171: Why wait with a predicate?</h4>
<div class="outline-text-4" id="text-orgb085b9b">
<p>
Predicates protect against spurious wakeups and re-check correctness on wake.
</p>

<div class="org-src-container">
<pre class="src src-cpp">cv.wait(lock, [&amp;]{ <span style="font-weight: bold;">return</span> ready; });
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb5287ae" class="outline-4">
<h4 id="orgb5287ae">Q172: What are <code>future</code> and <code>promise</code>?</h4>
<div class="outline-text-4" id="text-orgb5287ae">
<p>
They provide asynchronous result passing: producer sets result in <code>promise</code>, consumer gets it through <code>future</code>.
</p>
</div>
</div>
<div id="outline-container-org0e20436" class="outline-4">
<h4 id="org0e20436">Q173: What is a <code>std::async</code> caveat?</h4>
<div class="outline-text-4" id="text-org0e20436">
<p>
Launch policy matters. Without explicit <code>std::launch::async</code>, execution may be deferred until <code>get()/wait()</code>.
</p>
</div>
</div>
<div id="outline-container-org3269b66" class="outline-4">
<h4 id="org3269b66">Q174: What is the challenge in lock-free programming?</h4>
<div class="outline-text-4" id="text-org3269b66">
<p>
Correctness is very hard: memory ordering, ABA, reclamation, and subtle race bugs make design complex.
</p>
</div>
</div>
<div id="outline-container-org80b5bdb" class="outline-4">
<h4 id="org80b5bdb">Q175: What is the ABA problem?</h4>
<div class="outline-text-4" id="text-org80b5bdb">
<p>
A CAS check sees value A again and assumes nothing changed, even though state changed A→B→A in between.
</p>
</div>
</div>
<div id="outline-container-org15d9e4b" class="outline-4">
<h4 id="org15d9e4b">Q176: What are hazard pointers / epoch reclamation?</h4>
<div class="outline-text-4" id="text-org15d9e4b">
<p>
They are strategies for safe memory reclamation in lock-free structures, preventing reclamation while data may still be observed.
</p>
</div>
</div>
<div id="outline-container-org917fd5b" class="outline-4">
<h4 id="org917fd5b">Q177: What are modules in C++20?</h4>
<div class="outline-text-4" id="text-org917fd5b">
<p>
Modules are a modern alternative to textual headers, improving compile scalability and dependency hygiene.
</p>
</div>
</div>
<div id="outline-container-orga7fc8dd" class="outline-4">
<h4 id="orga7fc8dd">Q178: Benefits of modules over headers?</h4>
<div class="outline-text-4" id="text-orga7fc8dd">
<p>
Faster builds, better encapsulation, and less macro/definition leakage across boundaries.
</p>
</div>
</div>
<div id="outline-container-org163bcdb" class="outline-4">
<h4 id="org163bcdb">Q179: What is the role of a build system in C++?</h4>
<div class="outline-text-4" id="text-org163bcdb">
<p>
It manages compilation units, dependencies, flags, linking, and test/build orchestration across environments.
</p>
</div>
</div>
<div id="outline-container-org60483fb" class="outline-4">
<h4 id="org60483fb">Q180: Why compile with high warning levels?</h4>
<div class="outline-text-4" id="text-org60483fb">
<p>
Warnings catch bugs early, enforce consistency, and improve long-term code quality.
</p>
</div>
</div>
