public/posts/cpp.html
<div id="outline-container-org668209a" class="outline-4">
<h4 id="org668209a">Q181: Useful baseline warning flags?</h4>
<div class="outline-text-4" id="text-org668209a">
<p>
A common baseline is <code>-Wall -Wextra -Wpedantic</code> plus stricter project-specific flags.
</p>
</div>
</div>
<div id="outline-container-org5ca835d" class="outline-4">
<h4 id="org5ca835d">Q182: Why test with multiple compilers?</h4>
<div class="outline-text-4" id="text-org5ca835d">
<p>
Different compilers expose different warnings, optimizations, and edge-case behavior, revealing hidden portability bugs.
</p>
</div>
</div>
<div id="outline-container-orgfdc2504" class="outline-4">
<h4 id="orgfdc2504">Q183: What is the sanitizer suite for C++?</h4>
<div class="outline-text-4" id="text-orgfdc2504">
<ul class="org-ul">
<li>ASan: memory safety errors</li>
<li>UBSan: undefined behavior checks</li>
<li>TSan: data race detection</li>
<li>MSan: uninitialized read detection (where supported)</li>
</ul>
</div>
</div>
<div id="outline-container-org1d36c4c" class="outline-4">
<h4 id="org1d36c4c">Q184: Why use fuzzing in C++?</h4>
<div class="outline-text-4" id="text-org1d36c4c">
<p>
Fuzzing finds rare edge-case crashes and logic bugs by generating many unexpected inputs automatically.
</p>
</div>
</div>
<div id="outline-container-org45f9b52" class="outline-4">
<h4 id="org45f9b52">Q185: What is a benchmarking trap?</h4>
<div class="outline-text-4" id="text-org45f9b52">
<p>
Microbenchmarks can mislead when they do not represent real workloads or ignore compiler/runtime effects.
</p>
</div>
</div>
<div id="outline-container-org9cd48fe" class="outline-4">
<h4 id="org9cd48fe">Q186: What is Profile-Guided Optimization (PGO)?</h4>
<div class="outline-text-4" id="text-org9cd48fe">
<p>
PGO uses real execution profiles to guide optimization decisions like inlining and branch layout.
</p>
</div>
</div>
<div id="outline-container-org224fa7c" class="outline-4">
<h4 id="org224fa7c">Q187: What is Link-Time Optimization (LTO)?</h4>
<div class="outline-text-4" id="text-org224fa7c">
<p>
LTO enables whole-program optimization at link stage, improving inlining and cross-module optimization opportunities.
</p>
</div>
</div>
<div id="outline-container-org3f075f0" class="outline-4">
<h4 id="org3f075f0">Q188: What is devirtualization?</h4>
<div class="outline-text-4" id="text-org3f075f0">
<p>
Devirtualization replaces virtual calls with direct calls when the compiler can prove concrete type, reducing dispatch overhead.
</p>
</div>
</div>
<div id="outline-container-orge553b9c" class="outline-4">
<h4 id="orge553b9c">Q189: What is ABI compatibility concern in libraries?</h4>
<div class="outline-text-4" id="text-orge553b9c">
<p>
Changing exported layouts/signatures/symbols can break already-compiled client binaries.
</p>
</div>
</div>
<div id="outline-container-orgf139827" class="outline-4">
<h4 id="orgf139827">Q190: How to maintain ABI stability?</h4>
<div class="outline-text-4" id="text-orgf139827">
<p>
Use pImpl, minimize exposed details, manage symbol versions carefully, and apply strict semantic versioning discipline.
</p>
</div>
</div>
<div id="outline-container-org04429e4" class="outline-4">
<h4 id="org04429e4">Q191: Why avoid exposing STL types in stable ABI boundaries?</h4>
<div class="outline-text-4" id="text-org04429e4">
<p>
ABI details can differ across compilers/standard library implementations, risking binary incompatibility.
</p>
</div>
</div>
<div id="outline-container-org3b51a55" class="outline-4">
<h4 id="org3b51a55">Q192: What is strong typedef pattern?</h4>
<div class="outline-text-4" id="text-org3b51a55">
<p>
Strong typedef wraps primitive types in distinct types to prevent semantic mix-ups (e.g., <code>UserId</code> vs <code>OrderId</code>).
</p>
</div>
</div>
<div id="outline-container-org812811a" class="outline-4">
<h4 id="org812811a">Q193: What is value semantics?</h4>
<div class="outline-text-4" id="text-org812811a">
<p>
Value-semantics objects own their state and behave like independent values when copied/moved.
</p>
</div>
</div>
<div id="outline-container-org628078a" class="outline-4">
<h4 id="org628078a">Q194: Why prefer value semantics by default?</h4>
<div class="outline-text-4" id="text-org628078a">
<p>
It simplifies reasoning, reduces aliasing/lifetime errors, and often improves API clarity.
</p>
</div>
</div>
<div id="outline-container-orgb317865" class="outline-4">
<h4 id="orgb317865">Q195: What is “zero-cost abstraction” in C++?</h4>
<div class="outline-text-4" id="text-orgb317865">
<p>
Abstractions should not impose runtime cost beyond what equivalent hand-written low-level code would pay.
</p>
</div>
</div>
<div id="outline-container-org7e9f38f" class="outline-4">
<h4 id="org7e9f38f">Q196: What is a modern C++ API design guideline?</h4>
<div class="outline-text-4" id="text-org7e9f38f">
<p>
Make ownership explicit, keep interfaces small, use const-correctness, avoid raw owning pointers, and choose expressive types.
</p>
</div>
</div>
<div id="outline-container-orga3bc1ec" class="outline-4">
<h4 id="orga3bc1ec">Q197: Should raw pointers be exposed in interfaces?</h4>
<div class="outline-text-4" id="text-orga3bc1ec">
<p>
Yes for non-owning/nullable observation when semantically right, but ownership and lifetime rules must be clearly documented.
</p>
</div>
</div>
<div id="outline-container-orgeb0c199" class="outline-4">
<h4 id="orgeb0c199">Q198: What distinguishes expert C++ code from average code?</h4>
<div class="outline-text-4" id="text-orgeb0c199">
<p>
Expert code stays correct under complexity, expresses ownership/lifetimes clearly, performs measurably, and remains maintainable.
</p>
</div>
</div>
<div id="outline-container-orge122659" class="outline-4">
<h4 id="orge122659">Q199: What is a practical migration path from legacy C++?</h4>
<div class="outline-text-4" id="text-orge122659">
<p>
Modernize incrementally: introduce RAII, smart pointers, safer containers/APIs, add tests/sanitizers, then refactor in small verified steps.
</p>
</div>
</div>
<div id="outline-container-org45cf716" class="outline-4">
<h4 id="org45cf716">Q200: What is an expert workflow for C++ development?</h4>
<div class="outline-text-4" id="text-org45cf716">
<ol class="org-ol">
<li>Define clear contracts and invariants</li>
<li>Build the simplest correct design first</li>
<li>Enable strict warnings and static checks</li>
<li>Add tests, fuzzing, and sanitizers</li>
<li>Profile before optimizing</li>
<li>Review for UB, lifetime, and concurrency risks</li>
<li>Document assumptions and performance boundaries</li>
</ol>

<hr>

<div class="site-footer">
    <ul class="social-icons">
        <li><a href="https://github.com/bdostumski" rel="nofollow noopener noreferrer"><i class="fab fa-fw fa-github" aria-hidden="true"></i> GitHub</a></li>
        <li><a href="https://www.linkedin.com/in/borislav-dostumski/" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> LinkedIn</a></li>
        <li><a href="https://www.youtube.com/@borislavdostumski6006" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> YouTube</a></li>
    </ul>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
